package net.xidlims.service.common;

import java.io.File;
import java.text.ParseException;
import java.util.ArrayList;
import java.util.Calendar;
import java.util.List;
import java.util.Map;
import java.util.Set;

import javax.servlet.http.HttpServletRequest;
import javax.servlet.http.HttpServletResponse;

import net.xidlims.domain.Authority;
import net.xidlims.domain.CDictionary;
import net.xidlims.domain.CStaticValue;
import net.xidlims.domain.IotSharePowerOpentime;
import net.xidlims.domain.LabCenter;
import net.xidlims.domain.LabRoom;
import net.xidlims.domain.LabRoomDevice;
import net.xidlims.domain.LabRoomLimitTime;
import net.xidlims.domain.SchoolAcademy;
import net.xidlims.domain.SchoolCourse;
import net.xidlims.domain.SchoolCourseStudent;
import net.xidlims.domain.SchoolTerm;
import net.xidlims.domain.SchoolWeek;
import net.xidlims.domain.SystemBuild;
import net.xidlims.domain.TimetableAppointment;
import net.xidlims.domain.User;
import net.xidlims.domain.WkUpload;

import org.springframework.transaction.annotation.Transactional;

import excelTools.People;

public interface ShareService {
	
	/**
	 * 获取字典数据
	 * @author hly
	 * 2015.08.03
	 */
	public List<CDictionary> getCDictionaryData(String category);
	
	/**
	 * 根据类别和编号获取字典数据
	 * @author hly
	 * 2015.08.04
	 */
	public CDictionary getCDictionaryByCategory(String category, String number);
	
	/**
	 * 获取所有的学期数据
	 * @author hly
	 * 2015.08.03
	 */
	public List<SchoolTerm> findAllSchoolTerm();

	/*
	 * 分页显示
	 */

	@Transactional
	public Map<String, Integer> getPage(int currpage, int pageSize, int totalRecords);

	/*
	 * 获取登录人的所有信息
	 */

	public User getUser();

	/*
	 * 处理中文乱码 作者：彭文玉
	 */

	public String htmlEncode(String str);

	/*
	 * 获得当前页数
	 */

	public int getCurrpage(HttpServletRequest request);

	/*
	 * 查找到最近的学期； 作者：彭文玉
	 */

	public SchoolTerm findNewTerm();

	/*
	 * 获取当前日期的字符串 作者：彭文玉
	 */

	public String getDate1();

	/*
	 * 获取所有的周次；
	 */

	public Map getWeeksMap(int termId);

	/*
	 * 获取所有的星期； 作者：彭文玉
	 */

	public Map getWeekdays();

	/*
	 * 获取所有的星期List； 作者：彭文玉
	 */

	public List<SchoolTerm> getWeekdaysList();

	/*
	 * 获取所有的用户列表； 作者：彭文玉
	 */

	public Map getUsersMap();

	/*
	 * 获取所有用户的username 作者：彭文玉
	 */

	public Map getAllUsernameMap();

	/*
	 * 选择的周次的方式 作者：彭文玉
	 */

	public Map getWeekStatus();

	/*
	 * 跳页 作者：彭文玉
	 */

	public Map getChoosedPage(int page);

	/*
	 * 教师需求状态Map 作者：彭文玉
	 */

	public Map getNeedStatusMap();

	/*
	 * 获取可选的周次 作者：彭文玉 2013-10-21
	 */

	public Map getChoosedWeeks(String week);

	/*
	 * 获取可选的节次 作者：彭文玉
	 */

	public Map getChoosedClasses(String allClass);

	/*
	 * 得到所有的学期 作者：彭文玉
	 */

	public Map getTermsMap();

	/*
	 * 获取所有的周次 作者：彭文玉
	 */

	public Map getWeekMap();

	/*
	 * 获取需要添加排课调整时间的学期Map 作者：彭文玉
	 */

	public Map getTermsByAdjust(List<SchoolTerm> terms);

	/*
	 * 获取Map的term 作者：彭文玉
	 */

	public List<SchoolTerm> getTermsByTerm(String term);

	/*
	 * 根据周次获取term 作者：彭文玉
	 */

	public List<SchoolTerm> getTermsByWeek(int termId, String week);

	/**
	 * 获取所有的周次
	 */
	public Set<SchoolWeek> getAllWeek();

	/*
	 * 获取选中的周次 作者：彭文玉
	 */

	public Map getChoosedWeeks(Set<SchoolWeek> sets);

	/*
	 * 获取被选中的周次 作者：彭文玉
	 */

	public Set<SchoolWeek> getChooseWeek(String weekStr);

	/*
	 * 导出excel 作者：彭文玉
	 */

	public void exportExcel(List<Map> list, String title, String[] hearders,
			String[] fields, HttpServletRequest request,
			HttpServletResponse response) throws Exception;
	
	/**
	 * @内容：导出Excel
	 * @作者： 何立友
	 * @日期：2014-09-14
	 */
	public void exportExcel(List<Map> list, String title, String[] parentHearders, String[][] childrenHearders,
			String[] fields, HttpServletRequest request,
			HttpServletResponse response) throws Exception;
	
	/*
	 * 得到本周的周次 作者：彭文玉
	 */

	public int findNewWeek();

	/*
	 * 需要排课的学期 作者：彭文玉
	 */

	public Map getTermsByNow();

	/*
	 * 获取到目前为止的学期 作者：彭文玉
	 */

	public List<SchoolTerm> getCurrentTerms();

	/*
	 * 打印功能； 作者：彭文玉
	 */

	public void print();// 类结束

	/*
	 * 密码加密md5； 鲁静 2013.08.26
	 */

	public String createMD5(String s);

	/*
	 * 查找id等于idKey的权限；鲁静2013.08.27
	 */

	public Authority findAutnorityById(int idKey);

	/*
	 * 获取当前日期 鲁静 2013.09.04
	 */

	public String getDate();

	public Map getAppStatusMap();

	/*
	 * 维修结果 鲁静 2013.10.09
	 */

	public Map getEquipStatusMap();

	/*
	 * 查出所有的学院 鲁静 2013.09.18
	 */

	public Map getAllAcademy();

	/*
	 * 查出所有的班级 鲁静 2013.09.18
	 */

	public Map getAllClasses();

	public Map getAllDepartment();

	/*
	 * 自动增加的编号 鲁静 2013.09.23
	 */

	public ArrayList number();

	/*
	 * 获取时间 鲁静
	 */

	public String getDate2();

	/***********************************************************************************************
	 * 获取登录用户对象
	 * 作者：魏诚 
	 * 日期：2014-07-15
	 ***********************************************************************************************/
	public User getUserDetail();
	/***********************************************************************************************
	 * 获取上传文件的保存路径
	 * 作者：李小龙 
	 * 日期：2014-07-27
	 ***********************************************************************************************/
	public String getUpdateFilePath(HttpServletRequest request);
	/***********************************************************************************************
	 * 查询和当前登录人同一学院的用户
	 * 作者：李小龙 
	 ***********************************************************************************************/
	public List<User> findTheSameCollegeUser(String academyNumber);
	/***********************************************************************************************
	 * 查询和当前登录人同一学院的老师
	 * 作者：李小龙 
	 ***********************************************************************************************/
	public List<User> findTheSameCollegeTeacher(String academyNumber);
	/***********************************************************************************************
	 * 判断时间所属的学期
	 * 作者：李小龙 
	 ***********************************************************************************************/
	public SchoolTerm getBelongsSchoolTerm(Calendar time);
	
	/***********************************************************************************************
	 * 获取指定学期和学院的可用课程
	 * 作者：魏诚 
	 ***********************************************************************************************/
	public List<SchoolCourse> getSchoolCourseList(int termId);
	/***********************************************************************************************
	 * 根据权限id查询用户
	 * 作者：李小龙
	 ***********************************************************************************************/
	public List<User> findUsersByAuthorityId(int i);
	/***********************************************************************************************
	 * 查询所有的学期并倒序排列
	 * 作者：李小龙
	 ***********************************************************************************************/
	public List<SchoolTerm> findAllSchoolTerms();
	/***********************************************************************************************
	 * 查询所有的十二个学院
	 * 作者：李小龙
	 ***********************************************************************************************/
	public List<SchoolAcademy> findAllSchoolAcademys();
	/***********************************************************************************************
	 * 根据实验室判断实验室所属一期还是二期
	 * 作者：李小龙
	 ***********************************************************************************************/
	public int getLabRoomBelongsTime(LabRoom labRoom);
	/***********************************************************************************************
	 * 查询出实验室不为空的楼栋
	 * 作者：李小龙
	 ***********************************************************************************************/
	public List<SystemBuild> findNotEmptyBuild();

	/***********************************************************************************************
	 * 根据排课记录登录用户判断是否用户仅为老师权限，且是否为当前用户，或者为超级管理员或实验中心主任
	 * 作者：魏诚
	 ***********************************************************************************************/
	public boolean isOrNotAuthority(TimetableAppointment timetableAppointment);
	/***********************************************************************************************
	 * 获取所有的部门
	 * 作者：李小龙
	 ***********************************************************************************************/
	public Set<SchoolAcademy> getAllSchoolAcademy();
	/***********************************************************************************************
	 * 构建文件夹
	 * 作者：李小龙
	 ***********************************************************************************************/
	public File createDirdown();
	/***********************************************************************************************
	 * 下载文件
	 * 作者：李小龙
	 ***********************************************************************************************/
	public void downloadFile(String fileName, HttpServletRequest request,
			HttpServletResponse response);
	/***********************************************************************************************
	 * 查询排课所属学期的周次数量
	 * 作者：李小龙
	 ***********************************************************************************************/
	public int getTermNumber(TimetableAppointment t);
	/***********************************************************************************************
	 * 判断当前时间是否在指定时间（周次、星期）之后
	 * 作者：李小龙
	 ***********************************************************************************************/
	public boolean getTimeMark(Integer week, Integer weekday);
	/***********************************************************************************************
	 * 根据对象生成二维码，并返回二维码保存路径
	 * 作者：李小龙
	 ***********************************************************************************************/
	public String getDimensionalCode(LabRoomDevice d) throws Exception;
	/***********************************************************************************************
	 * 获取当前时间所属的周次星期信息
	 * 作者：李小龙
	 ***********************************************************************************************/
	public int getBelongsSchoolWeek(Calendar time);
	/***********************************************************************************************
	 * 获取已经排过课的课程
	 * 作者：李小龙
	 ***********************************************************************************************/
	public Set<SchoolCourse> findSchoolCourse();
	/***********************************************************************************************
	 * 根据课程获取教师
	 * 作者：李小龙
	 ***********************************************************************************************/
	public Set<User> findSchoolCourseTeachers(Set<SchoolCourse> schoolCourses);
	/***********************************************************************************************
	 * 根据选课组编号获取学生名单
	 * 作者：李小龙
	 ***********************************************************************************************/
	public List<SchoolCourseStudent> findStudentByCourseNo(String courseNo);
	/***********************************************************************************************
	 * 根据学生名单和周次统计学生实到次数
	 * 作者：李小龙
	 ***********************************************************************************************/
	public List<People> findPeopleByStudentsAndWeek(
			List<SchoolCourseStudent> studentList, Integer week,String courseNo);
	/***********************************************************************************************
	 * 根据选课组编号和周次统计缺勤次数
	 * 作者：李小龙
	 ***********************************************************************************************/
	public List<People> findAbsenceByStudentsAndWeek(Integer week, String courseNo);
	
	/**
	 * 判断指定用户是否具有指定权限
	 * @param username 用户工号
	 * @param authStr 权限标识
	 * @return boolean
	 * @author hely
	 * 2015.08.25
	 */
	public boolean checkAuthority(String username, String authStr);
	/***********************************************************************************************
	 * 获取所有教师数据
	 * 作者：贺子龙
	 ***********************************************************************************************/
	public List<User> findAllTeacheres();
	/***********************************************************************************************
	 * @功能：获取ip地址
	 * @作者：魏诚
	 ***********************************************************************************************/
	public String getIpAddr(HttpServletRequest request);
	/***********************************************************************************************
	 * @功能：根据学号判断是否为本科生
	 * @作者：贺子龙
	 ***********************************************************************************************/
	public boolean isUndergraduate(String username);
	/***********************************************************************************************
	 * @功能：根据年、月数字获取一个时间段
	 * @作者：贺子龙
	 ***********************************************************************************************/
	public Calendar[] getTimePeriod(int year, int month) throws ParseException;
	/***********************************************************************************************
	 * 判断月份所属的学期
	 * 作者：贺子龙
	 ***********************************************************************************************/
	public SchoolTerm getSchoolTermByMonth(int year, int month) throws ParseException;
	/***********************************************************************************************
	 * 判断该月份的起始和终止周次
	 * 作者：贺子龙
	 ***********************************************************************************************/
	public int[] getSchoolWeekByMonth(int year, int month) throws ParseException;
	/***********************************************************************************************
	 * 判断时间所对应的周次
	 * 作者：贺子龙
	 ***********************************************************************************************/
	public SchoolWeek getSchoolWeekByDate(Calendar time) throws ParseException;
	
	/***********************************************************************************************
	 * @功能：替换特殊字符
	 * @作者：贺子龙
	 * @日期：2016-03-07
	 ***********************************************************************************************/
	public String replaceString(String oldString);
	
	/***********************************************************************************************
	 * @功能：通用模塊service層定義-根据对象生成二维码，并返回二维码保存路径
	 * @作者：李小龙
	 ***********************************************************************************************/
	public String getDimensionalCode(LabRoomDevice d, String serverName) throws Exception;
	
	
	
	
	
	


	public Map getAllPosition();

	/***********************************************************************************************
	 * 根据模块名称和操作类型判断当前登录人是否具有操作权限
	 * 
	 * 作者：李小龙
	 ***********************************************************************************************/
	public boolean isAuthentificated(User user,String menu,String realm);
	/***********************************************************************************************
	 * 根据模块名称和操作类型判断当前登录人是否具有操作权限
	 * 作者：黄崔俊
	 * 时间：2015-10-26 16:50:20
	 ***********************************************************************************************/
	public boolean isAuthentificated(String menu, String realm, User user);
	/***********************************************************************************************
	 * 将文件上传到指定路径并返回文件保存路径
	 * 作者：李小龙
	 ***********************************************************************************************/
	public String fileUpload(HttpServletRequest request,String filePath);
	/***********************************************************************************************
	 * 删除指定路径的文件
	 * 作者：李小龙
	 ***********************************************************************************************/
	public boolean deleteFile(String documentUrl);
	/***********************************************************************************************
	 * 将指定文件上传到指定路径并返回文件保存路径
	 * 作者：李小龙
	 ***********************************************************************************************/
	public String fileUpload(String pageFile,HttpServletRequest request,String filePath);
	
	/***********************************************************************************************
	 * @功能： 处理资源列表的字符串 输入：包含资源id字符串，比如：,1632,1633,1634,1635,输入：资源id字符串,return upload集合
	 * @作者：魏诚
	 ***********************************************************************************************/
    public List<WkUpload> getUpload(String list);

    /***********************************************************************************************
	 * @功能：登录用户修改自己密码
	 * @作者：黄崔俊
	 ***********************************************************************************************/
	public User changeUserPassword(User user, String password);
	/**
	  *@comment：获取form上传的文件
	  *@param request
	  *@return：
	  *@author：叶明盾
	  *@date：2015-10-14 下午3:52:37
	 */
	public String getUpdateFileSavePath(HttpServletRequest request);

	/***********************************************************************************************
	 * 功能：将文件上传到指定路径并返回文件保存路径
	 * 作者：黄崔俊
	 * 时间：2015-12-14 14:02:30
	 ***********************************************************************************************/
	public String fileUpload(HttpServletRequest request, String folderName,
			String filePath);

	/***********************************************************************************************
	 * @2016-1-25 09:48:58：黄崔俊
	 * @时间：2016-1-25 09:48:58
	 ***********************************************************************************************/
	public User saveUser(User user1);
	
	/***********************************************************************************************
	 * @功能：通用模塊service層定義-上传文件
	 * @作者：魏诚 
	 * @日期：2014-07-27
	 ***********************************************************************************************/
	public void uploadFiles(HttpServletRequest request,String path,String type,int id) ;
	
	
	/***********************************************************************************************
	 * @功能：通用模塊service層定義-判断指定实验室的禁用时间段内，根据日历表的起始时间和结束时间判断是否可用
	 * @作者：魏诚
	 * @日期：2016-03-08
	 ***********************************************************************************************/
	public boolean isLimitedByTime(List<LabRoomLimitTime> labRoomLimitTimes,Calendar startDate,Calendar endDate) ;

	/***********************************************************************************************
	 * @功能：通用模塊service層定義-根据周次星期信息获取当前时间
	 * @作者：魏诚
	 * @日期：2016-03-05
	 ***********************************************************************************************/
	public String getDateByWeekdayClassWeek(int weekday,
			int startClass, int i, int term, int j);
	/***********************************************************************************************
	 * @功能：通用username找到user
	 * @作者：郑昕茹
	 * @日期：2016-08-07
	 ***********************************************************************************************/
	public User findUserByUsername(String username);
	
	/*************************************************************************************
	 * Description：排课模块-ajax获取可用周次{判断当前的实验室是否属于不需要判冲的特殊实验室}
	 * 
	 * @author： 贺子龙
	 * @date：2016-07-27
	 *************************************************************************************/
	public boolean isSpecialLabRoom(int labRoomId);
	
	/*************************************************************************************
	 * Description：设备预约模块-根据日期获取其所在天的电源控制器开放时间
	 * 
	 * @author： 郑昕茹
	 * @date：2016-10-18
	 *************************************************************************************/
	public IotSharePowerOpentime getBelongNowdayIotSharePowerOpentime(Calendar c);
	
	/***********************************************************************************************
	 * @功能：获取专业列表map
	 * @作者：裴继超
	 * @日期：2016年7月13日9:18:37
	 ***********************************************************************************************/

	public Map getMajorsMap();
	
	/***********************************************************************************************
	 * 学期-查找当前学期及以后的学期
	 * 作者：裴继超
	 * 时间：2016年8月11日11:38:44
	 ***********************************************************************************************/
	public List<SchoolTerm> getNowAndAfterSchoolTerm(Calendar time);
	
	
	/***********************************************************************************************
	 * @功能：通用模塊service層定義-修改登录的角色
	 * @作者：魏诚 
	 * @日期：2016-11-17
	 ***********************************************************************************************/
	public void changeRole(final String authorityName);
	
	/***********************************************************************************************
	 * description:根据学院编号获取所有教师
	 * @author：郑昕茹
	 * @date:2017-04-17
	 ***********************************************************************************************/
	public List<User> findAllTeacheresByAcademyNumber(String academyNumber);
	
	/***********************************************************************************************
		 * @功能：判断时间字符串所属的周次
		 * @作者：贺子龙
		 * @日期：2016-05-18
		 ***********************************************************************************************/
	public SchoolWeek getSchoolWeekByString(String timeString);

	/***********************************************************************************************
	 * @功能：判断时间字符串所属的周次
	 * @作者：贺子龙
	 * @日期：2016-05-18
	 ***********************************************************************************************/
	public CStaticValue findCStaticValueByCodeAndAcademy(String code, String academy);
	
	/*************************************************************************************
	 * @Description: 实验室预约-实验室预约{通过week,weekday,termId查找一条SchoolWeek}
	 * @author： 郭宇翀
	 * @date：2016-09-14
	 *************************************************************************************/
	public SchoolWeek findSchoolWeekByWeekAndWeekDay(int week, int weekday,int termId);
	
	/***********************************************************************************************
	 * @功能：判断时间字符串所属的节次
	 * @作者：贺子龙
	 * @日期：2016-05-18
	 ***********************************************************************************************/
	public int getSystemTimeByString(String timeString, int cid);
	
	/***********************************************************************************************
	 * @description：根据权限名找到权限
	 * @author:郑昕茹
	 * @date: 2017-05-28
	***********************************************************************************************/
	public Authority findAuthorityByAuthorityName(String authorityName);
	
	/***********************************************************************************************
	 * @description：根据权限找到拥有该权限的用户
	 * @author:郑昕茹
	 * @date: 2017-06-04
	***********************************************************************************************/
	public List<User> findUsersByAuthority(Integer authorityId);
	
	/***********************************************************************************************
	 * 判断时间所属的学期
	 * 作者：王昊 
	 ***********************************************************************************************/
	public SchoolTerm getBelongsSchoolTerm1(Calendar time);
	/***********************************************************************************************
	 * 查询所有的学期并倒序排列
	 * 作者：王昊
	 ***********************************************************************************************/
	public List<SchoolTerm> findAllSchoolTerms1();



}