package net.xidlims.service.lab;

import java.util.List;
import java.util.Set;

import javax.servlet.http.HttpServletRequest;
import javax.servlet.http.HttpServletResponse;

import net.xidlims.domain.LabAnnex;
import net.xidlims.domain.LabRoom;



public interface LabAnnexService {
	/****************************************************************************
	 * 功能：查询出所有的实验室
	 * 作者：李小龙
	 * 时间：2014-07-24
	 ****************************************************************************/
	public Set<LabAnnex> findAllLabAnnex();
	/****************************************************************************
	 * 功能：查询出某一中心下的所有的实验室
	 * 作者：贺子龙
	 * 时间：2015-11-30
	 ****************************************************************************/
	public List<LabAnnex> findAllLabAnnexBySchoolAcademy(int cid);
	
	/****************************************************************************
	 * 功能：根据分页信息查询出所有的实验室
	 * 作者：李小龙
	 * 时间：2014-07-25
	 ****************************************************************************/
	public List<LabAnnex> getAllLabAnnexs(int currpage, int pageSize);
	/****************************************************************************
	 * 功能：根据实验室信息查询实验室
	 * 作者：李小龙
	 * 时间：2014-07-25
	 ****************************************************************************/
	public List<LabAnnex> findLabAnnexByLabAnnex(LabAnnex labAnnex,Integer cid);
	/****************************************************************************
	 * 功能：根据实验室信息查询实验室并分页
	 * 作者：李小龙
	 * 时间：2014-07-25
	 ****************************************************************************/
	public List<LabAnnex> findLabAnnexByLabAnnex(LabAnnex labAnnex,Integer cid, int page,
			int pageSize);
	
	/****************************************************************************
	 * 功能：删除实验室对象
	 * 作者：李小龙
	 * 时间：2014-07-25
	 ****************************************************************************/
	public void deleteLabAnnex(LabAnnex annex);
	/****************************************************************************
	 * 功能：查询出所有的实验室类别
	 * 作者：李小龙
	 * 时间：2014-07-27
	 ****************************************************************************/
	//(字典表整合到CDictionary表中，放弃该方法)(hcj 2016-5-25 11:02:23)
	//public Set<CLabAnnexType> findAllCLabAnnexType();
	/****************************************************************************
	 * 功能：保存实验室对象
	 * 作者：李小龙
	 * 时间：2014-07-27
	 ****************************************************************************/
	public LabAnnex save(LabAnnex labAnnex);
	/****************************************************************************
	 * 功能：保存实验室的文档
	 * 作者：李小龙
	 * 时间：2014-07-28
	 ****************************************************************************/
	public void saveDocument(String fileTrueName, Integer labAnnexid);
	/****************************************************************************
	 * 功能：上传实验室图片
	 * 作者：李小龙
	 * 时间：2014-07-28
	 ****************************************************************************/
	public void imageUpload(HttpServletRequest request,
			HttpServletResponse response, Integer id);
	/****************************************************************************
	 * 功能：上传实验室视频
	 * 作者：李小龙
	 * 时间：2014-07-28
	 ****************************************************************************/
	public void videoUpload(HttpServletRequest request,
			HttpServletResponse response, Integer id);
	/****************************************************************************
	 * 功能：保存实验室的视频
	 * 作者：李小龙
	 * 时间：2014-07-28
	 ****************************************************************************/
	public void saveVideo(String fileTrueName, Integer labAnnexid);
	/****************************************************************************
	 * 功能：根据实验室id查询实验分室
	 * 作者：李小龙
	 * 时间：2014-07-29
	 * @param labRoom 
	 ****************************************************************************/
	public List<LabRoom> findLabRoomByLabAnnexId(LabRoom labRoom, Integer id);
	/****************************************************************************
	 * 功能：根据实验室id查询实验分室并分页
	 * 作者：李小龙
	 * 时间：2014-07-29
	 * @param labRoom 
	 ****************************************************************************/
	public List<LabRoom> findLabRoomByLabAnnexId(LabRoom labRoom, Integer id,Integer page, int pageSize);
	/****************************************************************************
	 * 功能：联动查询-学院&实验室
	 * 作者：徐文
	 * 日期：2016-5-10
	 ****************************************************************************/
	public String LinkSchoolAcademyAndLabAnnex(String schoolAcademy);
	
	/************************************************************************************
	 * 功能：查询labannex
	 * 姓名：徐文
	 * 日期：2016-4-26
	 **************************************************************************************/
	public List<LabAnnex> findAllLabAnnexByQuery(Integer currpage, Integer pageSize, LabAnnex labAnnex, Integer cid);
	/**************************************************************************************
	 * 功能：根据实验室主键查找实验室对象
	 * 姓名：徐文
	 * 日期：2016-4-27
	 **************************************************************************************/
	public LabAnnex findLabAnnexByPrimaryKey(Integer labAnnexId);
	/**************************************************************************************
	 * 功能：保存实验室数据
	 * 姓名：徐文
	 * 日期：2016-4-27
	 ***************************************************************************************/
	public LabAnnex saveLabAnnex(LabAnnex labAnnex);
	/*************************************************************************************
	 *功能： 删除实验室数据
	 *姓名：徐文
	 *日期：2016-4-27
	 ***********************************************************************************/
	public boolean deleteLabAnnex(Integer labAnnexId);
}