package net.xidlims.service.system;

import java.util.List;
import java.util.Map;

import com.google.inject.persist.Transactional;

import net.xidlims.domain.User;

public interface UserDetailService {

	/*************************************************************************************
	 * @內容：根据学院编号获取用户的总记录数
	 * @作者： 叶明盾
	 * @日期：2014-08-14
	 *************************************************************************************/
	public int getUserTotalRecords(String number);
	
	/*************************************************************************************
	 * @內容：根据学院编号获取用户的总记录数
	 * @作者： 叶明盾
	 * @日期：2014-08-14
	 *************************************************************************************/
	public int getUserTotalRecords(User user,String number);
	
	/*************************************************************************************
	 * @內容：获取查询的用户数
	 * @作者： 何立友
	 * @日期：2014-09-23
	 *************************************************************************************/
	public int getUserTotalRecordsByQuery(String queryStr);
	
	/*************************************************************************************
	 * @內容：查找所有的用户信息
	 * @作者： 叶明盾
	 * @日期：2014-08-14
	 *************************************************************************************/
	public List<User> findAllUsers(int curr, int size);
	
	/*************************************************************************************
	 * @內容：获取用户user的分页列表信息
	 * @作者： 叶明盾
	 * @日期：2014-08-18
	 *************************************************************************************/
	public List<User> findUserByQuery(User user, int curr, int size,String number);
	
	/*************************************************************************************
	 * @內容：根据用户的Username查找出相应的用户信息
	 * @作者： 叶明盾
	 * @日期：2014-09-02
	 *************************************************************************************/
	public User findUserByNum(String id);
	
	/*************************************************************************************
	 * @內容：查找指定学院所有的用户信息
	 * @作者： 何立友
	 * @日期：2014-09-24
	 *************************************************************************************/
	public List<User> findUsersByAcademy(String academyNumber);
	
	/*************************************************************************************
	 * @內容：根据学院编号和user对象查询User并分页
	 * @作者： 李小龙
	 *************************************************************************************/
	public List<User> getUserTotalRecords(User user, String number, int currpage, int pageSize);
	
	public List<User> findAllUsers(String userRole);
	
	
	/**
	 * 获取当前学年下的本学院学生
	 * 裴继超
	 * 2016年7月12日17:18:32
	 */
	public List<User> findUsersByAcademyAndGrade(String academyName, int year);

	/**
	 * 获取当前学院下的学年列表
	 * 裴继超
	 * 2016年7月12日17:18:32
	 */
	public List<User> findGradesByAcademy(String academyName);
	
	/**************************************************************************
	 * Description:系统管理-用户管理-获取用户的总记录数
	 * 
	 * @author：于侃 
	 * @date ：2016-08-24
	 **************************************************************************/
	@Transactional
	public int getUserTotalRecords(User user);
	
	/**************************************************************************
	 * Description:系统管理-用户管理-查找所有的用户信息
	 * 
	 * @author：于侃 
	 * @date ：2016-08-24
	 **************************************************************************/
	public List<User> findUsers();
	
	/**************************************************************************
	 * Description:系统管理-用户管理-根据user对象查询User并分页
	 * 
	 * @author：于侃 
	 * @date ：2016-08-24
	 **************************************************************************/
	public List<User> getUserTotalRecords(User user,int currpage, int pageSize);
	
	/**************************************************************************
	 * Description:系统管理-用户管理-新建User对象
	 * 
	 * @author：于侃 
	 * @date ：2016-08-24
	 **************************************************************************/
	public void saveUser(User user);
	/*************************************************************************************
	 * Description:进行人员过滤的ajax调用
	 *
	 * @author：戴昊宇
	 * @date：2017-08-21
	 *************************************************************************************/
	public List<Map<String,String>> coolSuggestTuser(String tUserName);
}