package net.xidlims.service.devicePurchase;

import java.util.List;
import java.util.Set;

import net.xidlims.domain.CDeviceStatus;
import net.xidlims.domain.CDeviceSupplier;
import net.xidlims.domain.NDevicePurchase;

/**
 * Spring service that handles CRUD requests for CDeviceStatus entities
 * 
 */
public interface CDeviceStatusService {

	/***********************************************************************************
	 * @功能：获取当前设备状态
	 * @author 郑昕茹
	 * @日期：2016-07-20
	 * **********************************************************************************/
	
	public List<CDeviceStatus> findCDeviceStatus(Integer currpage, Integer pageSize);
	/***********************************************************************************
	 * @功能：保存设备状态信息
	 * @author 郑昕茹
	 * @日期：2016-07-20
	 * **********************************************************************************/
	public CDeviceStatus saveCDeviceStatus(CDeviceStatus cDeviceStatus);
	
	/***********************************************************************************
	 * @功能：根据设备状态主键找到设备状态信息
	 * @author 郑昕茹
	 * @日期：2016-07-20
	 * **********************************************************************************/
	public CDeviceStatus findCDeviceStatusByPrimaryKey(Integer id);
	
	/***********************************************************************************
	 * @功能：删除-通过主键找到设备状态信息
	 * @author 郑昕茹
	 * @日期：2016-07-20
	 * **********************************************************************************/
	public boolean deleteCDeviceStatus(Integer id);
	/***********************************************************************************
	 * @功能：根据属性deviceStatusOrder找到设备状态信息
	 * @author 郑昕茹
	 * @日期：2016-07-22
	 * **********************************************************************************/
	public CDeviceStatus findCDeviceStatusByStatusOrder(Integer order);
	/***********************************************************************************
	 * @功能：找到 设备状态中orderStatus最大的那条记录
	 * @author 郑昕茹
	 * @日期：2016-07-22
	 * **********************************************************************************/
	public CDeviceStatus findMaxStatusOrder();
	/***********************************************************************************
	 * @功能：找到 设备状态中orderStatus最小的那条记录
	 * @author 郑昕茹
	 * @日期：2016-07-25
	 * **********************************************************************************/
	public CDeviceStatus findMinStatusOrder();
	/***********************************************************************************
	 * @功能：获取正常状态的设备记录
	 * @author 郑昕茹
	 * @日期：2016-07-23
	 * **********************************************************************************/
	public List<CDeviceStatus> findCDeviceStatusByFlag(Integer currpage, Integer pageSize);
	/***********************************************************************************
	 * @功能：将所有的特殊状态记录下移order
	 * @author 郑昕茹
	 * @日期：2016-07-23
	 * **********************************************************************************/
	public boolean MoveOrder();
	/***********************************************************************************
	 * @功能：类型改变后的重新排序
	 * @author 郑昕茹
	 * @日期：2016-07-23
	 * **********************************************************************************/
	public boolean reOrderAfterChangeFlag(Integer flag, CDeviceStatus cDeviceStatus);
	/***********************************************************************************
	 * @功能：获取所有的设备状态供应商
	 * @author 郑昕茹
	 * @日期：2016-07-26
	 * **********************************************************************************/
	public List<CDeviceSupplier> findCDeviceSuppliers(Integer currpage, Integer pageSize, CDeviceSupplier cDeviceSupplier);
	/***********************************************************************************
	 * @功能：根据主键找到设备供应商信息
	 * @author 郑昕茹
	 * @日期：2016-07-26
	 * **********************************************************************************/
	public CDeviceSupplier findCDeviceSupplierByPrimaryKey(Integer id);
	/***********************************************************************************
	 * @功能：保存设备供应商信息
	 * @author 郑昕茹
	 * @日期：2016-07-26
	 * **********************************************************************************/
	public CDeviceSupplier  saveCDeviceSupplier(CDeviceSupplier cDeviceSupplier);
	/***********************************************************************************
	 * @功能：删除-通过主键找到设备供应商信息然后删除
	 * @author 郑昕茹
	 * @日期：2016-07-26
	 * **********************************************************************************/
	public boolean deleteCDeviceSupplier(Integer id);

}