package net.xidlims.service.tcoursesite;

import java.util.Map;

import net.xidlims.domain.TCourseSite;
import net.xidlims.domain.WkChapter;

public interface WkChapterService {
	/**********************************************************************************
	 * 保存章节 
	 * 
	 **********************************************************************************/
	public WkChapter saveChapter(WkChapter chapter);
	/**********************************************************************************
	 * 根据主键查询章节 
	 * 
	 **********************************************************************************/
	public WkChapter findChapterByPrimaryKey(Integer chapterId);
	/**********************************************************************************
	 * 删除章节 
	 * 
	 **********************************************************************************/
	public void deleteChapter(WkChapter chapter);
	
	/**********************************************************************************
	 * 获取排序值最大的章节
	 * 裴继超
	 * 2016年5月31日15:29:23
	 **********************************************************************************/
	public int queryMaxChapterSeqBySiteId(TCourseSite tCourseSite) ;
	
	/**********************************************************************************
	 * 获取排序值最小的章节
	 * 裴继超
	 * 2016年5月31日15:29:23
	 **********************************************************************************/
	public int queryMinChapterSeqBySiteId(TCourseSite tCourseSite) ;
	
	/**********************************************************************************
	 * 获取排序值比选中章节小的章节
	 * 裴继超
	 * 2016年5月31日15:29:23
	 **********************************************************************************/
	public int querysmallChapterSeqBySiteId(WkChapter wkChapter) ;
	
	/**********************************************************************************
	 * 获取排序值比选中章节大的章节
	 * 裴继超
	 * 2016年5月31日15:29:23
	 **********************************************************************************/
	public int querybigChapterSeqBySiteId(WkChapter wkChapter);
	
	/**********************************************************************************
	 * 复制章节资源
	 * 裴继超
	 * 2016年6月15日9:59:03
	 **********************************************************************************/
	public int copyWkChapter(Integer tCourseSiteId,Integer wkChapterId);
	
	/**************************************************************************
	 * Description:知识技能体验-ajax根据type和课程id获取章节
	 * 
	 * @author：裴继超
	 * @date ：2016年8月19日16:47:20
	 **************************************************************************/
	public Map findChapterMapByModuleTypeAndSiteId(Integer tCourseSiteId,Integer moduleType);
	
	
}